app/controllers/watermark_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def preview
    @photo = Photo.find(params[:id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit(id = nil)
    @temp ="temp"
    # константы позиций рисунка и угол поворота изображения
    positions = {
        left:     [Magick::WestGravity, -90],
        right:    [Magick::EastGravity, -90],
        top:      [Magick::NorthGravity, nil],
        bottom:   [Magick::SouthGravity, nil],
        diagonal: [Magick::CenterGravity, -45]
    }

    @photo = Photo.find(params[:id] || id)